# vim: filetype=zsh

# Load packages and environment settings first
# "${ZDOTDIR}/.zpackages"
"${ZDOTDIR}/.zpyenv"

# Deferred execution of zsh commands
romkatv/zsh-defer

#
# .zsh_plugins.txt - antidote plugins file
#

# Core libraries
ohmyzsh/ohmyzsh
ohmyzsh/ohmyzsh path:lib

# Load essential plugins
ohmyzsh/ohmyzsh path:plugins/alias-finder kind:defer
ohmyzsh/ohmyzsh path:plugins/aliases
ohmyzsh/ohmyzsh path:plugins/ansible kind:defer
ohmyzsh/ohmyzsh path:plugins/autopep8 kind:fpath
ohmyzsh/ohmyzsh path:plugins/aws kind:defer
ohmyzsh/ohmyzsh path:plugins/azure kind:defer
ohmyzsh/ohmyzsh path:plugins/battery
# ohmyzsh/ohmyzsh path:plugins/brew
ohmyzsh/ohmyzsh path:plugins/colemak
ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/colorize kind:defer
ohmyzsh/ohmyzsh path:plugins/command-not-found
ohmyzsh/ohmyzsh path:plugins/compleat
ohmyzsh/ohmyzsh path:plugins/copybuffer
ohmyzsh/ohmyzsh path:plugins/copyfile
ohmyzsh/ohmyzsh path:plugins/copypath
ohmyzsh/ohmyzsh path:plugins/cp
ohmyzsh/ohmyzsh path:plugins/direnv kind:defer
ohmyzsh/ohmyzsh path:plugins/dnf
ohmyzsh/ohmyzsh path:plugins/dnote kind:fpath kind:defer
ohmyzsh/ohmyzsh path:plugins/docker kind:defer
ohmyzsh/ohmyzsh path:plugins/docker-compose kind:defer
ohmyzsh/ohmyzsh path:plugins/docker-machine kind:defer
ohmyzsh/ohmyzsh path:plugins/extract kind:defer
ohmyzsh/ohmyzsh path:plugins/eza kind:defer
ohmyzsh/ohmyzsh path:plugins/fancy-ctrl-z
ohmyzsh/ohmyzsh path:plugins/fasd kind:defer
ohmyzsh/ohmyzsh path:plugins/fastfile kind:defer
ohmyzsh/ohmyzsh path:plugins/fd kind:fpath
ohmyzsh/ohmyzsh path:plugins/firewalld kind:defer
ohmyzsh/ohmyzsh path:plugins/fnm
ohmyzsh/ohmyzsh path:plugins/fzf kind:defer
ohmyzsh/ohmyzsh path:plugins/genpass kind:defer
ohmyzsh/ohmyzsh path:plugins/gh kind:defer
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/git-auto-fetch kind:defer
ohmyzsh/ohmyzsh path:plugins/git-commit
ohmyzsh/ohmyzsh path:plugins/git-escape-magic
ohmyzsh/ohmyzsh path:plugins/git-extras kind:defer
ohmyzsh/ohmyzsh path:plugins/gitfast kind:defer
ohmyzsh/ohmyzsh path:plugins/gitignore
# ohmyzsh/ohmyzsh path:plugins/globalias
ohmyzsh/ohmyzsh path:plugins/gnu-utils kind:defer
ohmyzsh/ohmyzsh path:plugins/golang
# ohmyzsh/ohmyzsh path:plugins/gpg-agent
ohmyzsh/ohmyzsh path:plugins/grc
ohmyzsh/ohmyzsh path:plugins/history
ohmyzsh/ohmyzsh path:plugins/history-substring-search
ohmyzsh/ohmyzsh path:plugins/keychain
ohmyzsh/ohmyzsh path:plugins/kubectl kind:defer
ohmyzsh/ohmyzsh path:plugins/kubectx kind:defer
ohmyzsh/ohmyzsh path:plugins/last-working-dir kind:defer
# ohmyzsh/ohmyzsh path:plugins/magic-enter
ohmyzsh/ohmyzsh path:plugins/man kind:defer
ohmyzsh/ohmyzsh path:plugins/minikube kind:defer
ohmyzsh/ohmyzsh path:plugins/mvn kind:defer
ohmyzsh/ohmyzsh path:plugins/nmap kind:defer
ohmyzsh/ohmyzsh path:plugins/node kind:defer
ohmyzsh/ohmyzsh path:plugins/npm
ohmyzsh/ohmyzsh path:plugins/nvm
ohmyzsh/ohmyzsh path:plugins/pep8 kind:fpath
ohmyzsh/ohmyzsh path:plugins/per-directory-history
ohmyzsh/ohmyzsh path:plugins/pip
ohmyzsh/ohmyzsh path:plugins/pipenv kind:defer
ohmyzsh/ohmyzsh path:plugins/podman kind:defer
ohmyzsh/ohmyzsh path:plugins/pyenv
ohmyzsh/ohmyzsh path:plugins/pylint
ohmyzsh/ohmyzsh path:plugins/python
ohmyzsh/ohmyzsh path:plugins/qrcode kind:defer
ohmyzsh/ohmyzsh path:plugins/rbw kind:defer
ohmyzsh/ohmyzsh path:plugins/ripgrep kind:fpath
ohmyzsh/ohmyzsh path:plugins/rsync kind:defer
ohmyzsh/ohmyzsh path:plugins/rust kind:defer
ohmyzsh/ohmyzsh path:plugins/safe-paste
ohmyzsh/ohmyzsh path:plugins/shrink-path
ohmyzsh/ohmyzsh path:plugins/sprunge kind:defer
# ohmyzsh/ohmyzsh path:plugins/ssh
# ohmyzsh/ohmyzsh path:plugins/ssh-agent
ohmyzsh/ohmyzsh path:plugins/starship
ohmyzsh/ohmyzsh path:plugins/sudo
ohmyzsh/ohmyzsh path:plugins/systemadmin kind:defer
ohmyzsh/ohmyzsh path:plugins/systemd
# ohmyzsh/ohmyzsh path:plugins/thefuck
ohmyzsh/ohmyzsh path:plugins/terraform kind:defer
ohmyzsh/ohmyzsh path:plugins/timer kind:defer
ohmyzsh/ohmyzsh path:plugins/tmux
ohmyzsh/ohmyzsh path:plugins/tmuxinator kind:defer
ohmyzsh/ohmyzsh path:plugins/transfer kind:defer
ohmyzsh/ohmyzsh path:plugins/ubuntu kind:defer
ohmyzsh/ohmyzsh path:plugins/universalarchive kind:defer
ohmyzsh/ohmyzsh path:plugins/urltools kind:defer
# ohmyzsh/ohmyzsh path:plugins/vi-mode
ohmyzsh/ohmyzsh path:plugins/virtualenvwrapper kind:defer
ohmyzsh/ohmyzsh path:plugins/vscode kind:defer
ohmyzsh/ohmyzsh path:plugins/web-search kind:defer
ohmyzsh/ohmyzsh path:plugins/yum kind:defer
ohmyzsh/ohmyzsh path:plugins/zbell
ohmyzsh/ohmyzsh path:plugins/zoxide
# ohmyzsh/ohmyzsh path:plugins/zsh-interactive-cd
ohmyzsh/ohmyzsh path:plugins/zsh-navigation-tools

# Ensure these core libraries are loaded after plugins
ohmyzsh/ohmyzsh path:lib/completion.zsh
ohmyzsh/ohmyzsh path:lib/functions.zsh
ohmyzsh/ohmyzsh path:lib/git.zsh
ohmyzsh/ohmyzsh path:lib/history.zsh
ohmyzsh/ohmyzsh path:lib/key-bindings.zsh

# Now, configure and run compinit to initialize completions
# belak/zsh-utils path:completion
# sorin-ionescu/prezto path:modules/completion

# Additional completions
# srijanshetty/zsh-pip-completion path:src kind:fpath
# 3v1n0/zsh-bash-completions-fallback path:src kind:fpath
# MenkeTechnologies/zsh-cargo-completion path:src kind:fpath
# greymd/docker-zsh-completion path:src kind:fpath
# lukechilds/zsh-better-npm-completion path:src kind:fpath

# Utility plugins
eth-p/bat-extras path:src kind:path
eth-p/bat-extras path:src kind:fpath
wofr06/lesspipe kind:path
wofr06/lesspipe kind:fpath

# Colors
xPMo/zsh-ls-colors
catppuccin/tty path:src/mocha.sh

# History and completions
zsh-users/zsh-history-substring-search
zsh-users/zsh-completions

# olets/zsh-abbr # kind:defer # zsh manager for auto-expanding abbreviations

# MichaelAquilina/zsh-you-should-use kind:defer
psprint/zsh-sweep kind:defer

# Load personal configurations
"${ZDOTDIR}/.zeditor"
"${XDG_CONFIG_HOME}/git/.git.conf"
"${ZDOTDIR}/.zcred" # > /dev/null 2>&1 &
"${ZDOTDIR}/.zaliases"
"${ZDOTDIR}/.zfunctions"
"${ZDOTDIR}/.zxresources"


### Plugins that must be called last
# prompt 
zsh-users/zsh-syntax-highlighting
zdharma-continuum/fast-syntax-highlighting
# marlonrichert/zsh-autocomplete # Find as you type, then press Tab to insert the top completion or ↓to select another completion.
zsh-users/zsh-autosuggestions

# FZF
# Aloxaf/fzf-tab
Aloxaf/fzf-tab

# GPT
tom-doerr/zsh_codex


### THEME
romkatv/powerlevel10k

# WakaTime for Terminal
sobolevn/wakatime-zsh-plugin

# Load plugin configurations after all plugins are loaded
"${ZDOTDIR}/.zsh_plugin_configurations.zsh" kind:defer
