# vim: filetype=zsh

# Load packages and environment settings first
# "${ZDOTDIR}/.zpackages"
"${ZDOTDIR}/.zpyenv"

# Deferred execution of zsh commands
romkatv/zsh-defer

#
# .zsh_plugins.txt - antidote plugins file
#

# Core libraries
ohmyzsh/ohmyzsh
ohmyzsh/ohmyzsh path:lib

# Load essential plugins
ohmyzsh/ohmyzsh path:plugins/alias-finder
ohmyzsh/ohmyzsh path:plugins/aliases
ohmyzsh/ohmyzsh path:plugins/ansible
ohmyzsh/ohmyzsh path:plugins/autopep8 kind:fpath
ohmyzsh/ohmyzsh path:plugins/aws
ohmyzsh/ohmyzsh path:plugins/azure
ohmyzsh/ohmyzsh path:plugins/battery
# ohmyzsh/ohmyzsh path:plugins/brew
ohmyzsh/ohmyzsh path:plugins/colemak
ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/colorize
ohmyzsh/ohmyzsh path:plugins/command-not-found
ohmyzsh/ohmyzsh path:plugins/compleat
ohmyzsh/ohmyzsh path:plugins/copybuffer
ohmyzsh/ohmyzsh path:plugins/copyfile
ohmyzsh/ohmyzsh path:plugins/copypath
ohmyzsh/ohmyzsh path:plugins/cp
ohmyzsh/ohmyzsh path:plugins/direnv
ohmyzsh/ohmyzsh path:plugins/dnf
ohmyzsh/ohmyzsh path:plugins/dnote kind:fpath
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/docker-compose
# ohmyzsh/ohmyzsh path:plugins/docker-machine
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/eza
ohmyzsh/ohmyzsh path:plugins/fancy-ctrl-z
ohmyzsh/ohmyzsh path:plugins/fasd
ohmyzsh/ohmyzsh path:plugins/fastfile
ohmyzsh/ohmyzsh path:plugins/fd kind:fpath
ohmyzsh/ohmyzsh path:plugins/firewalld
ohmyzsh/ohmyzsh path:plugins/fnm
ohmyzsh/ohmyzsh path:plugins/fzf
ohmyzsh/ohmyzsh path:plugins/genpass
ohmyzsh/ohmyzsh path:plugins/gh
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/git-auto-fetch
ohmyzsh/ohmyzsh path:plugins/git-commit
ohmyzsh/ohmyzsh path:plugins/git-escape-magic
ohmyzsh/ohmyzsh path:plugins/git-extras
ohmyzsh/ohmyzsh path:plugins/gitfast
ohmyzsh/ohmyzsh path:plugins/gitignore
# ohmyzsh/ohmyzsh path:plugins/globalias
ohmyzsh/ohmyzsh path:plugins/gnu-utils
ohmyzsh/ohmyzsh path:plugins/golang
# ohmyzsh/ohmyzsh path:plugins/gpg-agent
ohmyzsh/ohmyzsh path:plugins/grc
ohmyzsh/ohmyzsh path:plugins/history
ohmyzsh/ohmyzsh path:plugins/history-substring-search
ohmyzsh/ohmyzsh path:plugins/keychain
ohmyzsh/ohmyzsh path:plugins/kubectl
ohmyzsh/ohmyzsh path:plugins/kubectx
ohmyzsh/ohmyzsh path:plugins/last-working-dir
# ohmyzsh/ohmyzsh path:plugins/magic-enter
ohmyzsh/ohmyzsh path:plugins/man
ohmyzsh/ohmyzsh path:plugins/minikube
ohmyzsh/ohmyzsh path:plugins/mvn
ohmyzsh/ohmyzsh path:plugins/nmap
ohmyzsh/ohmyzsh path:plugins/node
ohmyzsh/ohmyzsh path:plugins/npm
ohmyzsh/ohmyzsh path:plugins/nvm
ohmyzsh/ohmyzsh path:plugins/pep8 kind:fpath
ohmyzsh/ohmyzsh path:plugins/per-directory-history
ohmyzsh/ohmyzsh path:plugins/pip
ohmyzsh/ohmyzsh path:plugins/pipenv
ohmyzsh/ohmyzsh path:plugins/podman
ohmyzsh/ohmyzsh path:plugins/pyenv
ohmyzsh/ohmyzsh path:plugins/pylint
ohmyzsh/ohmyzsh path:plugins/python
ohmyzsh/ohmyzsh path:plugins/qrcode
ohmyzsh/ohmyzsh path:plugins/rbw
ohmyzsh/ohmyzsh path:plugins/ripgrep kind:fpath
ohmyzsh/ohmyzsh path:plugins/rsync
ohmyzsh/ohmyzsh path:plugins/rust
ohmyzsh/ohmyzsh path:plugins/safe-paste
ohmyzsh/ohmyzsh path:plugins/shrink-path
ohmyzsh/ohmyzsh path:plugins/sprunge
# ohmyzsh/ohmyzsh path:plugins/ssh
# ohmyzsh/ohmyzsh path:plugins/ssh-agent
ohmyzsh/ohmyzsh path:plugins/starship
ohmyzsh/ohmyzsh path:plugins/sudo
ohmyzsh/ohmyzsh path:plugins/systemadmin
ohmyzsh/ohmyzsh path:plugins/systemd
# ohmyzsh/ohmyzsh path:plugins/thefuck
ohmyzsh/ohmyzsh path:plugins/terraform
ohmyzsh/ohmyzsh path:plugins/timer
ohmyzsh/ohmyzsh path:plugins/tmux
ohmyzsh/ohmyzsh path:plugins/tmuxinator
ohmyzsh/ohmyzsh path:plugins/transfer
ohmyzsh/ohmyzsh path:plugins/ubuntu
ohmyzsh/ohmyzsh path:plugins/universalarchive
ohmyzsh/ohmyzsh path:plugins/urltools
# ohmyzsh/ohmyzsh path:plugins/vi-mode
ohmyzsh/ohmyzsh path:plugins/virtualenvwrapper
ohmyzsh/ohmyzsh path:plugins/vscode
ohmyzsh/ohmyzsh path:plugins/web-search
ohmyzsh/ohmyzsh path:plugins/yum
ohmyzsh/ohmyzsh path:plugins/zbell
ohmyzsh/ohmyzsh path:plugins/zoxide
# ohmyzsh/ohmyzsh path:plugins/zsh-interactive-cd
ohmyzsh/ohmyzsh path:plugins/zsh-navigation-tools

# Ensure these core libraries are loaded after plugins
ohmyzsh/ohmyzsh path:lib/completion.zsh
ohmyzsh/ohmyzsh path:lib/functions.zsh
ohmyzsh/ohmyzsh path:lib/git.zsh
ohmyzsh/ohmyzsh path:lib/history.zsh
ohmyzsh/ohmyzsh path:lib/key-bindings.zsh

# Now, configure and run compinit to initialize completions
# belak/zsh-utils path:completion
# sorin-ionescu/prezto path:modules/completion

# Additional completions
# srijanshetty/zsh-pip-completion path:src kind:fpath
# 3v1n0/zsh-bash-completions-fallback path:src kind:fpath
# MenkeTechnologies/zsh-cargo-completion path:src kind:fpath
# greymd/docker-zsh-completion path:src kind:fpath
# lukechilds/zsh-better-npm-completion path:src kind:fpath

# Utility plugins
eth-p/bat-extras path:src kind:path
eth-p/bat-extras path:src kind:fpath
wofr06/lesspipe kind:path
wofr06/lesspipe kind:fpath
z-shell/zsh-eza

# Colors
xPMo/zsh-ls-colors
catppuccin/tty path:src/mocha.sh

# History and completions
zsh-users/zsh-history-substring-search
zsh-users/zsh-completions

# olets/zsh-abbr # kind:defer # zsh manager for auto-expanding abbreviations

# MichaelAquilina/zsh-you-should-use kind:defer
psprint/zsh-sweep kind:defer

# Load personal configurations
"${ZDOTDIR}/.zeditor"
"${XDG_CONFIG_HOME}/git/.git.conf"
"${ZDOTDIR}/.zaliases"
"${ZDOTDIR}/.zfunctions"
"${ZDOTDIR}/.zxresources"


### Plugins that must be called last
# prompt 
# zsh-users/zsh-syntax-highlighting
zdharma-continuum/fast-syntax-highlighting
# marlonrichert/zsh-autocomplete # Find as you type, then press Tab to insert the top completion or ↓to select another completion.
zsh-users/zsh-autosuggestions

# FZF
# Aloxaf/fzf-tab
Aloxaf/fzf-tab

# GPT
tom-doerr/zsh_codex


### THEME
romkatv/powerlevel10k

# WakaTime for Terminal
sobolevn/wakatime-zsh-plugin

# Load plugin configurations after all plugins are loaded
"${ZDOTDIR}/.zsh_plugin_configurations.zsh" # kind:defer
