# vim: filetype=zsh

#
# .zsh_plugins.txt - antidote plugins file
#
ohmyzsh/ohmyzsh                             kind:zsh
# ohmyzsh/ohmyzsh                             path:lib
ohmyzsh/ohmyzsh                             path:plugins/ag kind:fpath
ohmyzsh/ohmyzsh                             path:plugins/alias-finder
ohmyzsh/ohmyzsh                             path:plugins/aliases
ohmyzsh/ohmyzsh                             path:plugins/ansible
ohmyzsh/ohmyzsh                             path:plugins/autoenv
ohmyzsh/ohmyzsh                             path:plugins/battery
ohmyzsh/ohmyzsh                             path:plugins/brew kind:zsh
ohmyzsh/ohmyzsh                             path:plugins/colemak kind:zsh
ohmyzsh/ohmyzsh                             path:plugins/colored-man-pages
ohmyzsh/ohmyzsh                             path:plugins/colorize
ohmyzsh/ohmyzsh                             path:plugins/command-not-found
ohmyzsh/ohmyzsh                             path:plugins/compleat kind:zsh
ohmyzsh/ohmyzsh                             path:plugins/copybuffer
ohmyzsh/ohmyzsh                             path:plugins/copyfile
ohmyzsh/ohmyzsh                             path:plugins/copypath
ohmyzsh/ohmyzsh                             path:plugins/cp
ohmyzsh/ohmyzsh                             path:plugins/direnv
ohmyzsh/ohmyzsh                             path:plugins/dnf
ohmyzsh/ohmyzsh                             path:plugins/dnote kind:fpath
ohmyzsh/ohmyzsh                             path:plugins/docker kind:zsh
ohmyzsh/ohmyzsh                             path:plugins/docker-compose kind:zsh
ohmyzsh/ohmyzsh                             path:plugins/docker-machine
ohmyzsh/ohmyzsh                             path:plugins/emoji
ohmyzsh/ohmyzsh                             path:plugins/emotty
ohmyzsh/ohmyzsh                             path:plugins/extract
ohmyzsh/ohmyzsh                             path:plugins/fasd
ohmyzsh/ohmyzsh                             path:plugins/fd kind:fpath
ohmyzsh/ohmyzsh                             path:plugins/firewalld
ohmyzsh/ohmyzsh                             path:plugins/fnm
ohmyzsh/ohmyzsh                             path:plugins/fzf
ohmyzsh/ohmyzsh                             path:plugins/gh kind:zsh
ohmyzsh/ohmyzsh                             path:plugins/git
ohmyzsh/ohmyzsh                             path:plugins/git-auto-fetch
ohmyzsh/ohmyzsh                             path:plugins/git-commit
ohmyzsh/ohmyzsh                             path:plugins/git-escape-magic
ohmyzsh/ohmyzsh                             path:plugins/git-extras kind:zsh
ohmyzsh/ohmyzsh                             path:plugins/gitfast kind:zsh
ohmyzsh/ohmyzsh                             path:plugins/gitignore
ohmyzsh/ohmyzsh                             path:plugins/globalias
ohmyzsh/ohmyzsh                             path:plugins/gnu-utils
ohmyzsh/ohmyzsh                             path:plugins/golang
ohmyzsh/ohmyzsh                             path:plugins/gpg-agent
ohmyzsh/ohmyzsh                             path:plugins/grc
ohmyzsh/ohmyzsh                             path:plugins/history
ohmyzsh/ohmyzsh                             path:plugins/history-substring-search
ohmyzsh/ohmyzsh                             path:plugins/keychain
ohmyzsh/ohmyzsh                             path:plugins/kubectl kind:fpath
ohmyzsh/ohmyzsh                             path:plugins/kubectx
ohmyzsh/ohmyzsh                             path:plugins/last-working-dir
ohmyzsh/ohmyzsh                             path:plugins/magic-enter
ohmyzsh/ohmyzsh                             path:plugins/man
ohmyzsh/ohmyzsh                             path:plugins/minikube
ohmyzsh/ohmyzsh                             path:plugins/mvn
ohmyzsh/ohmyzsh                             path:plugins/nmap
ohmyzsh/ohmyzsh                             path:plugins/node
ohmyzsh/ohmyzsh                             path:plugins/npm
ohmyzsh/ohmyzsh                             path:plugins/nvm
ohmyzsh/ohmyzsh                             path:plugins/pep8 kind:fpath
ohmyzsh/ohmyzsh                             path:plugins/per-directory-history
ohmyzsh/ohmyzsh                             path:plugins/pip
ohmyzsh/ohmyzsh                             path:plugins/pipenv
ohmyzsh/ohmyzsh                             path:plugins/podman
ohmyzsh/ohmyzsh                             path:plugins/pyenv
ohmyzsh/ohmyzsh                             path:plugins/pylint
ohmyzsh/ohmyzsh                             path:plugins/python
ohmyzsh/ohmyzsh                             path:plugins/qrcode
ohmyzsh/ohmyzsh                             path:plugins/rbw
ohmyzsh/ohmyzsh                             path:plugins/ripgrep kind:fpath
ohmyzsh/ohmyzsh                             path:plugins/rsync
ohmyzsh/ohmyzsh                             path:plugins/rust
ohmyzsh/ohmyzsh                             path:plugins/safe-paste
ohmyzsh/ohmyzsh                             path:plugins/screen
ohmyzsh/ohmyzsh                             path:plugins/shrink-path
ohmyzsh/ohmyzsh                             path:plugins/sprunge
ohmyzsh/ohmyzsh                             path:plugins/ssh
ohmyzsh/ohmyzsh                             path:plugins/ssh-agent
ohmyzsh/ohmyzsh                             path:plugins/starship
# ohmyzsh/ohmyzsh                             path:plugins/sudo
ohmyzsh/ohmyzsh                             path:plugins/systemadmin
ohmyzsh/ohmyzsh                             path:plugins/systemd
ohmyzsh/ohmyzsh                             path:plugins/thefuck
ohmyzsh/ohmyzsh                             path:plugins/timer
ohmyzsh/ohmyzsh                             path:plugins/tmux
ohmyzsh/ohmyzsh                             path:plugins/tmuxinator
ohmyzsh/ohmyzsh                             path:plugins/transfer
ohmyzsh/ohmyzsh                             path:plugins/transfer
ohmyzsh/ohmyzsh                             path:plugins/ubuntu
ohmyzsh/ohmyzsh                             path:plugins/universalarchive
ohmyzsh/ohmyzsh                             path:plugins/urltools
# ohmyzsh/ohmyzsh                             path:plugins/vi-mode
ohmyzsh/ohmyzsh                             path:plugins/virtualenvwrapper
ohmyzsh/ohmyzsh                             path:plugins/vscode
ohmyzsh/ohmyzsh                             path:plugins/web-search
ohmyzsh/ohmyzsh                             path:plugins/yum
ohmyzsh/ohmyzsh                             path:plugins/zbell
ohmyzsh/ohmyzsh                             path:plugins/zoxide
ohmyzsh/ohmyzsh                             path:plugins/zsh-interactive-cd
ohmyzsh/ohmyzsh                             path:plugins/zsh-navigation-tools
ohmyzsh/ohmyzsh															path:lib/completion.zsh
ohmyzsh/ohmyzsh															path:lib/functions.zsh
ohmyzsh/ohmyzsh															path:lib/git.zsh
ohmyzsh/ohmyzsh															path:lib/history.zsh
ohmyzsh/ohmyzsh															path:lib/key-bindings.zsh

# FZF related plugins
unixorn/fzf-zsh-plugin                      branch:main
lincheney/fzf-tab-completion                path:zsh kind:zsh
mattmc3/zman #Use fzf to quickly browse Zsh manuals

xPMo/zsh-ls-colors
eth-p/bat-extras                            path:src kind:path
rummik/zsh-tailf #tail -f with prefixed newlines instead of trailing
neovim/neovim                               kind:clone
wofr06/lesspipe                             kind:path
wofr06/lesspipe                             kind:fpath
marlonrichert/zsh-autocomplete              # Find as you type, then press Tab to insert the top completion or ↓to select another completion.
catppuccin/tty                               path:src/mocha.sh


# srijanshetty/zsh-pip-completion             path:src kind:fpath
# 3v1n0/zsh-bash-completions-fallback         path:src kind:fpath
# MenkeTechnologies/zsh-cargo-completion      path:src kind:fpath
# greymd/docker-zsh-completion                path:src kind:fpath
# lukechilds/zsh-better-npm-completion        path:src kind:fpath
# sunlei/zsh-ssh                              path:src kind:fpath
# vasyharan/zsh-brew-services                 path:src kind:fpath
# viasite-ansible/zsh-ansible-server          path:src kind:fpath

johannchangpro/zsh-interactive-cd           
zsh-users/zsh-completions
zsh-users/zsh-history-substring-search     
zsh-users/zsh-autosuggestions               kind:zsh
zdharma-continuum/fast-syntax-highlighting
jeffreytse/zsh-vi-mode
olets/zsh-abbr                              kind:defer # zsh manager for auto-expanding abbreviations
djui/alias-tips                             kind:defer
MichaelAquilina/zsh-you-should-use          kind:defer
psprint/zsh-sweep                           kind:defer kind:zsh

${XDG_CONFIG_HOME}/git/.git.conf
${ZDOTDIR}/.zeditor
${ZDOTDIR}/.zaliases
${ZDOTDIR}/.zfunctions

# now, configure and run compinit to initialize completions
# belak/zsh-utils path:completion
sorin-ionescu/prezto path:modules/completion
